app/controllers/contributes_controller.rb

SELECT  "contributes".* FROM "contributes"  WHERE "contributes"."id" = ? LIMIT 1  [["id", 4]]
---
  def show
    @contribute = Contribute.find(params[:id])

INSERT INTO "contributes" ("content", "created_at", "entry_time", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @contribute = current_user.created_contributes.build(contribute_params)

SELECT  "contributes".* FROM "contributes"  WHERE "contributes"."user_id" = ? AND "contributes"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
---
  def edit
    @contribute = current_user.created_contributes.find(params[:id])

SELECT  "contributes".* FROM "contributes"  WHERE "contributes"."user_id" = ? AND "contributes"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
UPDATE "contributes" SET "title" = ?, "updated_at" = ? WHERE "contributes"."id" = 1  [["title", "Railsアプリ開発2日目"], ["updated_at", "2015-02-01 08:50:31.909483"]]
---
  def update
    @contribute = current_user.created_contributes.find(params[:id])
    if @contribute.update(contribute_params)

SELECT  "contributes".* FROM "contributes"  WHERE "contributes"."user_id" = ? AND "contributes"."id" = ? LIMIT 1  [["user_id", 1], ["id", 6]]
DELETE FROM "contributes" WHERE "contributes"."id" = ?  [["id", 6]]
---
  def destroy
    @contribute = current_user.created_contributes.find(params[:id])
    @contribute.destroy!