app/controllers/sessions_controller.rb

INSERT INTO "users" ("created_at", "image_url", "nickname", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    user = User.find_or_create_from_auth_hash(request.env['omniauth.auth'])