app/controllers/welcome_controller.rb

  def index
    #ログインユーザー
    @user = User.find_by(id: session[:user_id])
    @q = Contribute.page(params[:page]).per(PER).order(entry_time: :desc)
          .search(search_params)
    @contributes = @q.result(distinct: true)
    @update_date = Contribute.maximum(:updated_at)
---
SELECT  "contributes".* FROM "contributes"  WHERE ("contributes"."entry_time" >= '2015-02-03 12:18:55.362799')  ORDER BY "contributes"."entry_time" DESC LIMIT 10 OFFSET 10
SELECT COUNT(*) FROM "contributes"  WHERE ("contributes"."entry_time" >= '2015-02-03 12:18:55.362799')
SELECT "contributes".* FROM "contributes"  WHERE (user_id = NULL)